blog/index.org
#+TITLE: CtrlAltDelete.nu
#+DESCRIPTION: It's all about 42, (defn foobarbaz []) and cheeseburgers.
#+AUTHOR: Anton Erholt
#+STARTUP: indent hidestars
#+STARTUP: logdone
#+OPTIONS:   H:3 num:nil toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+OPTIONS:   skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+LANGUAGE:  en
#+HUGO_SECTION: blog
#+HUGO_BASE_DIR: ../
#+HUGO_AUTO_SET_LASTMOD: t
#+HUGO_WEIGHT: auto

** DONE How to set up SSH with key-based authentication         :ssh:config:
CLOSED: [2018-10-12 Fri 22:48]
:PROPERTIES:
:EXPORT_FILE_NAME: ssh-with-key-based-authentication
:END:


  SSH is a service used to connect remotely from one machine to
  another. It is used on pretty much all operating systems except
  Windows.

  In this example, I use two machines. The *workstation* is the
  machine we are connecting from and the *server* is the machine we
  are connecting to.

  First off, make sure SSH (*ssh*, *ssh-keygen*) is installed. Since I
  use Arch Linux it's already there by default. A quick search yields
  [[https://www.google.com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=2&ved=2ahUKEwj3ive2zYHeAhVBtosKHWsVBCEQFjABegQIBhAE&url=https%3A%2F%2Fwww.simplified.guide%2Fubuntu%2Finstall-ssh-server&usg=AOvVaw24xjG875GC72ufNqHsQV5z][this]] site with instructions for Ubuntu.


*** On the workstation

  Generate a long enough keypair. Keypair - a pair of keys. A public
  key and a private key. The two keys are actually two long numbers
  working nicely together for encryption and decryption.

  I use a key length of 4096 bits (at the time of writing this) and a
  key type of RSA (meaning we use the RSA algorithm for encryption and
  decryption). By default, *ssh-keygen* asks to save the keys as
  *~/.ssh/id_rsa* for the private key, and *~/.ssh/id_rsa.pub* for the
  public key.

#+BEGIN_SRC bash
ssh-keygen -t rsa -b 4096
#+END_SRC

  Create a new file in  *~/.ssh/config* with the following content:

#+BEGIN_SRC bash
Host <HOST-NICKNAME>
     Hostname <IP-OR-HOSTNAME>
     Port <PORT>
     User <USERNAME>
     IdentityFile <PATH-TO-GENERATED-PRIVATE-KEY>
#+END_SRC

  To transfer your public key on to the server,
  use *$ ssh-copy-id <HOST-NICKNAME>*.

*** On the server

  Edit the file */etc/ssh/sshd_config* so it contains these two lines.

#+BEGIN_SRC bash
RSAAuthentication yes
PubkeyAuthentication yes
#+END_SRC

  For various reasons I have also changed the following settings for
  the ssh daemon:

#+BEGIN_SRC bash
PermitRootLogin no
PasswordAuthentication no
X11Forwarding yes
PrintMotd no
#+END_SRC

  Why on earth did I set these?

  *PermitRootLogin no*

  Makes sure no one can access the server via the root account. It is
  highly unlikely (impossible) that anyone would brute-force this
  since the root user on my machine has a really long randomly
  generated password. Also this line is made redundant by the
  following line, since my root user don't have any keys generated. I
  have no idea why I set this in the first place.

  *PasswordAuthentication no*

  Make sure you have already copied your public key from a
  workstation here if you decide to use my additional settings, since
  you no longer will be able to ssh with a password.

  *X11Forwarding yes*

  Allows me to run graphical programs from the server on my
  workstation. Pretty darn cool feature. Use *ssh <HOST> -X* or
  *ssh <HOST> -Y* from the workstation.

  *PrintMotd*

  Motd - message of the day. I feel like I can live without it, but it
  can be really useful. Like listing if any upgrades are available or
  if any errors on some services need my immediate attention.

  Also, do not forget to reload the sshd config to put the new
  settings in effect. Since I have a Raspberry Pi running some version
  of Raspbian, I use *service ssh reload* to do just that.

